# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# EDSR
SR_model:
  # [from, number, module, args] 640 x 640
  [[-1, 1, MeanShift, [3, -1]],  # args: rgb_range
   [-1, 1, default_conv, [64, 3]],
   [-1, 8, ResBlock, [64, 3]],
   [-1, 1, default_conv, [64, 3]],
   [[-1, 2], 1, Add, [2]],
   [-1, 1, Upsampler, [64, 2]], # scale : 2,4 -> 256,  scale : 3 -> 9*64, scale
   [-1, 1, default_conv, [3, 3]],
   [-1, 1, MeanShift, [3, 1]], # 7
  ]

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 8-P1/2
   [-1, 1, Conv, [64, 3, 2]],  # 9-P2/4
   [-1, 1, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 2, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 19
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 16], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 23

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 14], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 23], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)

   [[27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
