# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

SR_model: []

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
  #----------------------------------------------------
   [-1, 1, default_conv, [128, 3]], # 11  SR_model instead upsample
   [-1, 8, ResBlock, [128, 3]],     # freeze
   [-1, 1, default_conv, [128, 3]], # freeze
   [[-1, 11], 1, Add, [2]],        # freeze
   [-1, 1, Upsampler, [128, 2]],    # freeze  scale : 2,4 -> 256,  scale : 3 -> 9*64, scale
   [-1, 1, default_conv, [512, 3]], # 16
  #----------------------------------------------------
   [[-1, 6], 1, Concat, [1]],  # 17 cat backbone P4
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]], # 19
  #----------------------------------------------------
   [-1, 1, default_conv, [128, 3]], # 20 SR_model instead upsample
   [-1, 8, ResBlock, [128, 3]],      # freeze
   [-1, 1, default_conv, [128, 3]],  # freeze
   [[-1, 20], 1, Add, [2]],         # freeze
   [-1, 1, Upsampler, [128, 2]],     # freeze  scale : 2,4 -> 256,  scale : 3 -> 9*64, scale
   [-1, 1, default_conv, [256, 3]], # 25
  #----------------------------------------------------
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)

   [[27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
